[
    "A person is walking forwards.",
    "A person walks 4 steps forward.",
    "A human walking",
    "A person walks forward at medium speed.",
    "human slowly goes forward",
    "A human walks four slow steps forward",
    "A person goes four and half steps forward.",
    "A person walking forward slightly to the right.",
    "A person walks slowly for four steps and stops.",
    "A person walks four steps to the forward direction.",
    "A person walks slowly 4 steps forward.",
    "A person stands, then walks a few steps, then stops again",
    "Someone is walking forward slowly doing 4 steps starting with the left leg.",
    "A person makes 4 steps forward slowly.",
    "A human walking backwards",
    "A person walks backwards four steps starting with the left foot.",
    "Somebody walks backwards.",
    "A person walking backwards for a few steps.",
    "A person walks four steps backward.",
    "A person walks backwards.",
    "A person walks backward at a slow speed.",
    "A human is walking 4 steps backwards and starting with its left food.",
    "A person walks backwards.",
    "some is reverse walking",
    "A person takes 4 steps backwards.",
    "A person moves backwards 4 steps before standing still",
    "Someone is walking backwards.",
    "a man is walking backwards",
    "Somebody walks a few steps backward.",
    "A person walks four steps backwards.",
    "A person walks backwards slowly.",
    "Somebody walks backward.",
    "A person is walking backwards.",
    "A person turns in a circle",
    "Someone walks in a circle counterclockwise",
    "Somebody wals a circle anticlockwise.",
    "A person walks in a circle counter clockwise.",
    "A person walks in a square.",
    "the person is walking in a circular shape",
    "A human walks slowly a full circle to its left.",
    "A person walks a full counter-clockwise circle.",
    "A person walks in a circle pattern one time.",
    "A person walks in a counter-clockwise circle.",
    "Somebody is walking in a circle.",
    "Person walking in a circle",
    "A person is walking in a circle",
    "Someone slowly walks a full circle to the left",
    "walking in a slow circle",
    "Someone walks a complete circle.",
    "A person turns around to the beginning.",
    "someone is walking a whole round to his left side",
    "a person is walking in a circle shape",
    "a person walks a circle to the left",
    "a person walks a circle",
    "A person walking in a circle to the left",
    "A person walks a circle in the left direction",
    "A person walks in a counter-clockwise circle",
    "Someone walks in a circle counterclockwise",
    "the person is walking through a  circular path",
    "A human is walking in circle.",
    "human goes in a circle clockwise",
    "A person walking in a circle to the right",
    "Somebody walks a circle clockwise.",
    "A person walks in a clockwise circle",
    "A person running in a full circle, clockwise.",
    "A person walks a circle clock-wise.",
    "A person walks in clock-wise circle.",
    "A human is walking in a circle to the right.",
    "A person walks in a circle clockwise.",
    "A person walks in a circle and looks facing down.",
    "A person walks a circle in the right direction",
    "The human walks a circle (right turn)",
    "A Person walks in a circle clockwise.",
    "A person walks in a circle to his right side.",
    "A human walking in a circle clockwise",
    "A person walks in a little circle.",
    "a person walks a circle",
    "a person walks in circle in clockwise direction",
    "A person walks a circle clockwise.",
    "A perons walks a circle clockwise",
    "a man walks in circle",
    "A person walking in a quarter circle to the right",
    "A person walks while turning to the right.",
    "A person is walking forward four steps starting with the right foot and performing a right-turn of 90°",
    "A human performs a tight 90° right curve",
    "a person walks 90° of a circle to his right",
    "A person walks a quarter circle to the right, taking four steps.",
    "A person is turning right while walking",
    "Someone walks three steps in curve to the right",
    "A person walks a small half circle.",
    "Somebody walks a quarter circle in clockwise direction",
    "Subject walks a quarter circle clockwise.",
    "A person walks in a 90° curve to his right.",
    "A person waits on a ATM line and then goes to the machine.",
    "a human sit",
    "A person walks clockwise in a circle with 4 steps.",
    "A human performs a tight 90° curve to the right",
    "a human sit down",
    "a person walks a quarter rightwards circle",
    "A person walks in a quarter circle.",
    "human walks in a quater circle clockwise",
    "A person walks a quarter circle clockwise with 4 steps.",
    "A person is walking a left-turn",
    "A person walking forward in a 90° curve.",
    "A person walks a quarter circle to the right, taking four steps.",
    "Person walking backwards",
    "human goes backwards starting with left",
    "Subject walks backwards.",
    "A person takes 4 steps backwards starting with left.",
    "A person walks some steps backwards",
    "Person walking backwards",
    "Someone walks slowly backwards",
    "A person makes 4 steps backwards.",
    "A person walks backwards."
]